Revit 2027 API
EnergyAnalysisSpace.ComposedName Property
 The composed name for this space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ComposedName { get; }
Public ReadOnly Property ComposedName As String
	Get
public:
property String^ ComposedName {
	String^ get ();
}
member ComposedName : string with get
Property Value
String
Remarks
 This value is composed of the number and name attributes, separated by a space.
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace